// pages/check/check.ts
Page({

  /**
   * 页面的初始数据
   */
  data: {
    data: [{
      tag: '平和质 (A型)',
      desc: '阴阳气血调和，以体态适中、面色红润、精力充沛等为主要特征。面色、肤色润泽，头发稠密有光泽，目光有神，鼻色明润，嗅觉通利，唇色红润，不易疲劳，精力充沛。'
    }, {
      tag: '气虚质 (B型)',
      desc: '元气不足，以疲乏、气短、自汗等气虚表现为主要特征。平素语音低弱，气短懒言，容易疲乏，精神不振，易出汗，舌淡红，舌边有齿痕，脉弱。'
    }, {
      tag: '阳虚质 (C型)',
      desc: '阳气不足，以畏寒怕冷、手足不温等虚寒表现为主要特征。平素畏冷，手足不温，喜热饮食，精神不振，舌淡胖嫩，脉沉迟。'
    }, {
      tag: '阴虚质 (D型)',
      desc: '阴液亏少，以口燥咽干、手足心热等虚热表现为主要特征。手足心热，口燥咽干，鼻微干，喜冷饮，大便干燥，舌红少津，脉细数。'
    }, {
      tag: '痰湿质 (E型)',
      desc: '痰湿凝聚，以形体肥胖、腹部肥满、口黏苔腻等痰湿表现为主要特征。面部皮肤油脂较多，多汗且黏，胸闷，痰多，口黏腻或甜，喜食肥甘甜黏，苔腻，脉滑。'
    }, {
      tag: '湿热质 (F型)',
      desc: '湿热内蕴，以面垢油光、口苦、苔黄腻等湿热表现为主要特征。面垢油光，易生痤疮，口苦口干，身重困倦，大便黏滞不畅或燥结，小便短黄。'
    }, {
      tag: '血瘀质 (G型)',
      desc: '血行不畅，以肤色晦黯、舌质紫黯等血瘀表现为主要特征。肤色晦黯，色素沉着，容易出现瘀斑，口唇黯淡，舌黯或有瘀点，舌下络脉紫黯或增粗，脉涩。'
    }, {
      tag: '气郁质 (H型)',
      desc: '气机郁滞，以神情抑郁、忧虑脆弱等气郁表现为主要特征。神情抑郁，情感脆弱，烦闷不乐，舌淡红，苔薄白，脉弦。'
    }, {
      tag: '特禀质 (I型)',
      desc: '先天失常，以生理缺陷、过敏反应等为主要特征。过敏体质者常见哮喘、风团、咽痒、鼻塞、喷嚏等。'
    }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad() {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})